CBWSTC/CBWSTC_WorkSpace/Projects/ParkingFeeCalculator2/TC/tc#2#0.txt

<Sequence>
<Operation name="login" id="1">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <pfc:login  xmlns:pfc="http://pfc.simple.ws">
         <!--anonymous type-->
         <pfc:License>BJP44242</pfc:License>
         <!--anonymous type-->
         <pfc:loginTime>25</pfc:loginTime>
      </pfc:login>
   </soapenv:Body>
</soapenv:Envelope>
</Operation>
</Sequence>