CBWSTC/CBWSTC_WorkSpace/Projects/ParkingFeeCalculator/TC/tc#0#22.txt

<Sequence>
<Operation name="login" id="1">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pfc="http://pfc.simple.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <pfc:login>
         <!--anonymous type-->
         <pfc:License>BJJ24444</pfc:License>
         <!--anonymous type-->
         <pfc:loginTime>0</pfc:loginTime>
      </pfc:login>
   </soapenv:Body>
</soapenv:Envelope>
</Operation>
<Operation name="feeCalculate" id="1">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pfc="http://pfc.simple.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <pfc:feeCalculate>
         <!--anonymous type-->
         <pfc:License>BJJ24444</pfc:License>
         <!--anonymous type - enumeration: [0,1,2]-->
         <pfc:type>1</pfc:type>
         <!--anonymous type-->
         <pfc:timeout>2</pfc:timeout>
         <!--type: boolean-->
         <pfc:dayOfWeek>true</pfc:dayOfWeek>
         <!--type: boolean-->
         <pfc:discountCoupon>true</pfc:discountCoupon>
      </pfc:feeCalculate>
   </soapenv:Body>
</soapenv:Envelope>
</Operation>
<Operation name="login" id="2">
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pfc="http://pfc.simple.ws">
   <soapenv:Header/>
   <soapenv:Body>
      <pfc:login>
         <!--anonymous type-->
         <pfc:License>BJD02044</pfc:License>
         <!--anonymous type-->
         <pfc:loginTime>0</pfc:loginTime>
      </pfc:login>
   </soapenv:Body>
</soapenv:Envelope>
</Operation>
</Sequence>